In [1]:
# Dependencies
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd

In [3]:
city_data = pd.read_csv("Pyber/raw_data/city_data.csv")
ride_data = pd.read_csv("Pyber/raw_data/ride_data.csv")

In [7]:
city_data.head()

             city  driver_count   type
0      Kelseyland            63  Urban
1      Nguyenbury             8  Urban
2    East Douglas            12  Urban
3   West Dawnfurt            34  Urban
4  Rodriguezburgh            52  Urban

In [8]:
ride_data.head()

          city                 date   fare        ride_id
0     Sarabury  2016-01-16 13:49:27  38.35  5403689035038
1    South Roy  2016-01-02 18:42:34  17.49  4036272335942
2  Wiseborough  2016-01-21 17:35:29  44.18  3645042422587
3  Spencertown  2016-07-31 14:53:22   6.87  2242596575892
4   Nguyenbury  2016-07-09 04:42:44   6.28  1543057793673

In [23]:
final_data = pd.merge(ride_data,city_data, how = 'left', on = 'city')
final_data.head()

          city                 date   fare        ride_id  driver_count   type
0     Sarabury  2016-01-16 13:49:27  38.35  5403689035038            46  Urban
1    South Roy  2016-01-02 18:42:34  17.49  4036272335942            35  Urban
2  Wiseborough  2016-01-21 17:35:29  44.18  3645042422587            55  Urban
3  Spencertown  2016-07-31 14:53:22   6.87  2242596575892            68  Urban
4   Nguyenbury  2016-07-09 04:42:44   6.28  1543057793673             8  Urban